
# ============================================================================
# DMFNet_MDAFP3D_DySample
# 改进点: 在 DMFNet_MDAFP3D 基础上，将 Head 中的 nn.Upsample(nearest)
#         替换为 DySample 可学习动态上采样，提升小目标空间信息恢复质量
# 改动位置: Head layer 34, 37 (仅两处)
# 预期效果: 小目标mAP50提升0.3~1.0%，几乎不增加参数量
# ============================================================================

# Parameters
ch: 6
nc: 5 # number of classes (car, bus, van, truck, freight_car)
scales:
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# ========================== Backbone (与DMFNet_MDAFP3D完全一致) ==========================
backbone:
  # [from, repeats, module, args]
  - [-1, 1, IN, []]  # 0  恒等映射(6ch输入占位)
  - [-1, 1, Multiin, [1]]  # 1  提取RGB(前3通道)
  - [-2, 1, Multiin, [2]]  # 2  提取IR(后3通道)

  # ---- Visible branch (RGB) ----
  - [1, 1, Conv, [64, 3, 2]]              # 3-P1/2
  - [-1, 1, Conv, [128, 3, 2]]            # 4-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]     # 5
  - [-1, 1, Conv, [256, 3, 2]]            # 6-P3/8

  # ---- Infrared branch (IR) ----
  - [2, 1, Conv, [64, 3, 2]]              # 7-P1/2
  - [-1, 1, Conv, [128, 3, 2]]            # 8-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]     # 9
  - [-1, 1, Conv, [256, 3, 2]]            # 10-P3/8

  # ---- LAEF第一级: P3尺度跨模态对齐融合 ----
  - [[6, 10], 1, LAEF, [256, 512]]        # 11-P3/8

  - [[6, 11], 1, Concat, [1]]             # 12 RGB+融合特征
  - [-1, 2, C3k2, [512, False, 0.25]]     # 13
  - [-1, 1, Conv, [512, 3, 2]]            # 14-P4/16

  - [[10, 11], 1, Concat, [1]]            # 15 IR+融合特征
  - [-1, 2, C3k2, [512, False, 0.25]]     # 16
  - [-1, 1, Conv, [512, 3, 2]]            # 17-P4/16

  # ---- LAEF第二级: P4尺度跨模态对齐融合 ----
  - [[14, 17], 1, LAEF, [512, 512]]       # 18-P4/16

  # ---- Visible深层路径 ----
  - [[14, 18], 1, Concat, [1]]            # 19
  - [-1, 2, C3k2, [512, True]]            # 20
  - [-1, 1, Conv, [1024, 3, 2]]           # 21-P5/32
  - [-1, 2, C3k2, [1024, True]]           # 22
  - [-1, 1, SPPF, [1024, 5]]             # 23
  - [-1, 2, C2PSA, [1024]]               # 24

  # ---- Infrared深层路径 ----
  - [[17, 18], 1, Concat, [1]]            # 25
  - [-1, 2, C3k2, [512, True]]            # 26
  - [-1, 1, Conv, [1024, 3, 2]]           # 27-P5/32
  - [-1, 2, C3k2, [1024, True]]           # 28
  - [-1, 1, SPPF, [1024, 5]]             # 29
  - [-1, 2, C2PSA, [1024]]               # 30

  # ---- MDAFP3D: 三维注意力跨模态融合(Channel+Spatial+Cross-Modal) ----
  - [[13, 16], 1, MDAFP3D, [512, 4, 'WithBias', [3,5,7], 0.0, False]]    # 31 Fuse P3/8
  - [[20, 26], 1, MDAFP3D, [512, 8, 'WithBias', [5,9,13], 0.0, False]]   # 32 Fuse P4/16
  - [[24, 30], 1, MDAFP3D, [1024, 8, 'WithBias', [7,11,21], 0.0, True]]  # 33 Fuse P5/32

# ========================== Head (改进: DySample替代nn.Upsample) ==========================
# 改动说明:
#   原始: nn.Upsample [None, 2, "nearest"]  -- 固定最近邻插值，无可学习参数
#   改进: DySample [2]                       -- 可学习动态上采样，内容自适应采样偏移
#   改动层: #34, #37 (仅两处上采样)
head:
  # ★ 改动1: P5→P4 上采样使用DySample
  - [-1, 1, DySample, [2]]                # 34 DySample(scale=2) 替代 nn.Upsample
  - [[-1, 32], 1, Concat, [1]]            # 35 cat P4融合特征
  - [-1, 2, C3k2, [512, False]]           # 36

  # ★ 改动2: P4→P3 上采样使用DySample
  - [-1, 1, DySample, [2]]                # 37 DySample(scale=2) 替代 nn.Upsample
  - [[-1, 31], 1, Concat, [1]]            # 38 cat P3融合特征
  - [-1, 3, C3k2, [256, False]]           # 39 (P3/8-small)

  # PAN下采样路径(不变)
  - [-1, 1, SPDConv, [256]]            # 40
  - [[-1, 36], 1, Concat, [1]]            # 41 cat head P4
  - [-1, 2, C3k2, [512, False]]           # 42 (P4/16-medium)

  - [-1, 1, SPDConv, [512]]            # 43
  - [[-1, 33], 1, Concat, [1]]            # 44 cat head P5
  - [-1, 2, C3k2, [1024, True]]           # 45 (P5/32-large)

  - [[39, 42, 45], 1, Detect, [nc]]       # 46 Detect(P3, P4, P5)
