# DMFNet_MDAFP3D_Combined: 综合增强模型
# 基于 MDAFP3D 三维注意力融合 + DySample动态上采样 + LSKA大核注意力 + P4加深 + InnerIoU损失
# InnerIoU 通过环境变量 INNER_IOU_RATIO=0.7 控制
# Parameters
ch: 6
nc: 5 # number of classes
scales:
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

backbone:
  # [from, repeats, module, args]
  - [-1, 1, IN, []]  # 0
  - [-1, 1, Multiin, [1]]  # 1
  - [-2, 1, Multiin, [2]]  # 2
  # Visible branch
  - [1, 1, Conv, [64, 3, 2]] # 3-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 4-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]] #5
  - [-1, 1, Conv, [256, 3, 2]] # 6-P3/8
  # Infrared branch
  - [2, 1, Conv, [64, 3, 2]] # 7-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 8-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]  #9
  - [-1, 1, Conv, [256, 3, 2]] # 10-P3/8

    # 第一个模块
  - [[6, 10], 1, LAEF, [256, 512]]   # 11-P3/8

  - [[6, 11], 1, Concat, [1]]
  - [-1, 2, C3k2, [512, False, 0.25]] #13
  - [-1, 1, Conv, [512, 3, 2]] # 14-P4/16

  - [[10, 11], 1, Concat, [1]]
  - [-1, 2, C3k2, [512, False, 0.25]] #16
  - [-1, 1, Conv, [512, 3, 2]] # 17-P4/16

    # 第二个模块
  - [[14, 17], 1, LAEF, [512, 512]]   # 18-P4/16

  - [[14, 18], 1, Concat, [1]]
  - [-1, 2, C3k2, [512, True]] #20
  - [-1, 1, Conv, [1024, 3, 2]] # 21-P5/32
  - [-1, 2, C3k2, [1024, True]] #22
  - [-1, 1, SPPF, [1024, 5]] # 23
  - [-1, 2, C2PSA, [1024]] # 24

  - [[17, 18], 1, Concat, [1]]
  - [-1, 2, C3k2, [512, True]]  #26
  - [-1, 1, Conv, [1024, 3, 2]] # 27-P5/32
  - [-1, 2, C3k2, [1024, True]]  #28
  - [-1, 1, SPPF, [1024, 5]] # 29
  - [-1, 2, C2PSA, [1024]] # 30

  # ===== MDAFP3D: 三维注意力融合 =====
  - [[13, 16], 1, MDAFP3D, [512, 4, 'WithBias', [3,5,7], 0.0, False]]   # 31 Fuse P3/8
  - [[20, 26], 1, MDAFP3D, [512, 8, 'WithBias', [5,9,13], 0.0, False]]  # 32 Fuse P4/16
  - [[24, 30], 1, MDAFP3D, [1024, 8, 'WithBias', [7,11,21], 0.0, True]] # 33 Fuse P5/32

# ===== Head: DySample + LSKA + P4加深 =====
head:
  - [-1, 1, DySample, [2]]  # 34 DySample替代Upsample, scale=2
  - [[-1, 32], 1, Concat, [1]] # 35 cat P4融合特征
  - [-1, 2, C3k2, [512, False]] # 36

  - [-1, 1, DySample, [2]]  # 37 DySample替代Upsample, scale=2
  - [[-1, 31], 1, Concat, [1]] # 38 cat P3融合特征
  - [-1, 3, C3k2, [256, False]] # 39 P3检测特征, n=3

  - [-1, 1, LSKA, [35]]  # 40 P3大核注意力

  - [-1, 1, Conv, [256, 3, 2]]  # 41 下采样
  - [[-1, 36], 1, Concat, [1]] # 42 cat head P4
  - [-1, 3, C3k2, [512, False]] # 43 P4检测特征, n=3(加深)

  - [-1, 1, LSKA, [35]]  # 44 P4大核注意力

  - [-1, 1, Conv, [512, 3, 2]]  # 45 下采样
  - [[-1, 33], 1, Concat, [1]] # 46 cat P5融合特征
  - [-1, 2, C3k2, [1024, True]] # 47 P5检测特征

  - [[40, 44, 47], 1, Detect, [nc]] # 48 Detect(P3, P4, P5)
