
# DMFNet + MDAFP3D + 1x1Conv: 三维注意力跨模态融合后接1x1卷积特征精炼
# 在每个MDAFP3D融合模块后添加1x1 Conv(Conv+BN+SiLU)进行通道特征精炼
# Parameters
ch: 6
nc: 5 # number of classes
scales:
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

backbone:
  # [from, repeats, module, args]
  - [-1, 1, IN, []]  # 0
  - [-1, 1, Multiin, [1]]  # 1
  - [-2, 1, Multiin, [2]]  # 2
  # Visible branch
  - [1, 1, Conv, [64, 3, 2]] # 3-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 4-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]] #5
  - [-1, 1, Conv, [256, 3, 2]] # 6-P3/8
  # Infrared branch
  - [2, 1, Conv, [64, 3, 2]] # 7-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 8-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]  #9
  - [-1, 1, Conv, [256, 3, 2]] # 10-P3/8

    # 第一个模块
  - [[6, 10], 1, LAEF, [256, 512]]   # 11-P3/8

  - [[6, 11], 1, Concat, [1]]
  - [-1, 2, C3k2, [512, False, 0.25]] #13
  - [-1, 1, Conv, [512, 3, 2]] # 14-P4/16

  - [[10, 11], 1, Concat, [1]]
  - [-1, 2, C3k2, [512, False, 0.25]] #16
  - [-1, 1, Conv, [512, 3, 2]] # 17-P4/16

    # 第二个模块
  - [[14, 17], 1, LAEF, [512, 512]]   # 18-P4/16

  - [[14, 18], 1, Concat, [1]]
  - [-1, 2, C3k2, [512, True]] #20
  - [-1, 1, Conv, [1024, 3, 2]] # 21-P5/32
  - [-1, 2, C3k2, [1024, True]] #22
  - [-1, 1, SPPF, [1024, 5]] # 23
  - [-1, 2, C2PSA, [1024]] # 24

  - [[17, 18], 1, Concat, [1]]
  - [-1, 2, C3k2, [512, True]]  #26
  - [-1, 1, Conv, [1024, 3, 2]] # 27-P5/32
  - [-1, 2, C3k2, [1024, True]]  #28
  - [-1, 1, SPPF, [1024, 5]] # 29
  - [-1, 2, C2PSA, [1024]] # 30

  # ===== MDAFP3D + 1x1 Conv 特征精炼 =====
  - [[13, 16], 1, MDAFP3D, [512, 4, 'WithBias', [3,5,7], 0.0, False]]   # 31 Fuse P3/8
  - [-1, 1, Conv, [512, 1, 1]]                                            # 32 1x1 Conv P3

  - [[20, 26], 1, MDAFP3D, [512, 8, 'WithBias', [5,9,13], 0.0, False]]  # 33 Fuse P4/16
  - [-1, 1, Conv, [512, 1, 1]]                                            # 34 1x1 Conv P4

  - [[24, 30], 1, MDAFP3D, [1024, 8, 'WithBias', [7,11,21], 0.0, True]] # 35 Fuse P5/32
  - [-1, 1, Conv, [1024, 1, 1]]                                           # 36 1x1 Conv P5

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  #37
  - [[-1, 34], 1, Concat, [1]] # cat P4 refined  38
  - [-1, 2, C3k2, [512, False]] # 39

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  #40
  - [[-1, 32], 1, Concat, [1]] # cat P3 refined  41
  - [-1, 3, C3k2, [256, False]] # 42 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]  #43
  - [[-1, 39], 1, Concat, [1]] # cat head P4  44
  - [-1, 2, C3k2, [512, False]] # 45 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]  #46
  - [[-1, 36], 1, Concat, [1]] # cat P5 refined  47
  - [-1, 2, C3k2, [1024, True]] # 48 (P5/32-large)

  - [[42, 45, 48], 1, Detect, [nc]] # Detect(P3, P4, P5)  #49
