
# DMFNet + P2检测头: 增加stride=4的P2小目标检测层，4尺度检测(P2/P3/P4/P5)
# Parameters
ch: 6
nc: 5 # number of classes
scales:
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

backbone:
  # [from, repeats, module, args]
  - [-1, 1, IN, []]  # 0
  - [-1, 1, Multiin, [1]]  # 1
  - [-2, 1, Multiin, [2]]  # 2
  # Visible branch
  - [1, 1, Conv, [64, 3, 2]] # 3-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 4-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]] # 5  vis P2 features
  - [-1, 1, Conv, [256, 3, 2]] # 6-P3/8
  # Infrared branch
  - [2, 1, Conv, [64, 3, 2]] # 7-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 8-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]  # 9  ir P2 features
  - [-1, 1, Conv, [256, 3, 2]] # 10-P3/8

  # ===== P2 fusion (NEW) =====
  - [[5, 9], 1, MDAFP, [256, 4, 'WithBias', [3,5,7], 0.0, False]]  # 11 Fuse P2/4

  # ===== P3 LAEF (原11→12) =====
  - [[6, 10], 1, LAEF, [256, 512]]   # 12-P3/8

  - [[6, 12], 1, Concat, [1]]         # 13
  - [-1, 2, C3k2, [512, False, 0.25]] # 14
  - [-1, 1, Conv, [512, 3, 2]]        # 15-P4/16

  - [[10, 12], 1, Concat, [1]]        # 16
  - [-1, 2, C3k2, [512, False, 0.25]] # 17
  - [-1, 1, Conv, [512, 3, 2]]        # 18-P4/16

  # ===== P4 LAEF (原18→19) =====
  - [[15, 18], 1, LAEF, [512, 512]]   # 19-P4/16

  - [[15, 19], 1, Concat, [1]]        # 20
  - [-1, 2, C3k2, [512, True]]        # 21
  - [-1, 1, Conv, [1024, 3, 2]]       # 22-P5/32
  - [-1, 2, C3k2, [1024, True]]       # 23
  - [-1, 1, SPPF, [1024, 5]]          # 24
  - [-1, 2, C2PSA, [1024]]            # 25

  - [[18, 19], 1, Concat, [1]]        # 26
  - [-1, 2, C3k2, [512, True]]        # 27
  - [-1, 1, Conv, [1024, 3, 2]]       # 28-P5/32
  - [-1, 2, C3k2, [1024, True]]       # 29
  - [-1, 1, SPPF, [1024, 5]]          # 30
  - [-1, 2, C2PSA, [1024]]            # 31

  - [[14, 17], 1, MDAFP, [512, 4, 'WithBias', [3,5,7], 0.0, False]]    # 32 Fuse P3/8
  - [[21, 27], 1, MDAFP, [512, 8, 'WithBias', [5,9,13], 0.0, False]]   # 33 Fuse P4/16
  - [[25, 31], 1, MDAFP, [1024, 8, 'WithBias', [7,11,21], 0.0, True]]  # 34 Fuse P5/32

# head: 4尺度检测 P2/P3/P4/P5
head:
  # Top-down path
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 35
  - [[-1, 33], 1, Concat, [1]]                   # 36 cat P4_fused
  - [-1, 2, C3k2, [512, False]]                  # 37

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 38
  - [[-1, 32], 1, Concat, [1]]                    # 39 cat P3_fused
  - [-1, 2, C3k2, [256, False]]                   # 40 P3 features

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 41 NEW: upsample to P2
  - [[-1, 11], 1, Concat, [1]]                    # 42 cat P2_fused
  - [-1, 2, C3k2, [256, False]]                   # 43 (P2/4-tiny) detect head

  # Bottom-up path
  - [-1, 1, Conv, [256, 3, 2]]                    # 44 P2->P3
  - [[-1, 40], 1, Concat, [1]]                    # 45 cat P3
  - [-1, 2, C3k2, [256, False]]                   # 46 (P3/8-small) detect head

  - [-1, 1, Conv, [256, 3, 2]]                    # 47 P3->P4
  - [[-1, 37], 1, Concat, [1]]                    # 48 cat P4
  - [-1, 2, C3k2, [512, False]]                   # 49 (P4/16-medium) detect head

  - [-1, 1, Conv, [512, 3, 2]]                    # 50 P4->P5
  - [[-1, 34], 1, Concat, [1]]                    # 51 cat P5_fused
  - [-1, 2, C3k2, [1024, True]]                   # 52 (P5/32-large) detect head

  - [[43, 46, 49, 52], 1, Detect, [nc]]           # 53 Detect(P2, P3, P4, P5)
