# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLO11 object detection model with P3-P5 outputs. For Usage examples see https://docs.ultralytics.com/tasks/detect

#把loss.py里面159行的topk改成13（原本是10）   176行的beta改成4.0（原本6.0）

# Parameters
ch: 6
nc: 5 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolo11n.yaml' will call yolo11.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024] # summary: 319 layers, 2624080 parameters, 2624064 gradients, 6.6 GFLOPs
  s: [0.50, 0.50, 1024] # summary: 319 layers, 9458752 parameters, 9458736 gradients, 21.7 GFLOPs
  m: [0.50, 1.00, 512] # summary: 409 layers, 20114688 parameters, 20114672 gradients, 68.5 GFLOPs
  l: [1.00, 1.00, 512] # summary: 631 layers, 25372160 parameters, 25372144 gradients, 87.6 GFLOPs
  x: [1.00, 1.50, 512] # summary: 631 layers, 56966176 parameters, 56966160 gradients, 196.0 GFLOPs

backbone:
  # [from, repeats, module, args]
  - [-1, 1, IN, []]                 # 0
  - [-1, 1, Multiin, [1]]           # 1  RGB
  - [-2, 1, Multiin, [2]]           # 2  IR
  
  # Visible branch
  - [1, 1, HGStem, [32, 64]]        # 3  P2/4
  - [-1, 6, Light_HGBlock, [64, 128, 3]]                    # 4 stage1
  - [-1, 1, DWConv, [128, 3, 2, 1, False]]                  # 5  P3/8
  # Infrared branch
  - [2, 1, HGStem, [32, 64]]        # 6 P2/4
  - [-1, 6, Light_HGBlock, [64, 128, 3]]                    # 7 stage1
  - [-1, 1, DWConv, [128, 3, 2, 1, False]]                  # 8 P3/8

    # 第一个CPCA模块
  - [[5, 8], 1, LAEF, [256, 128]]   # 9-P3/8 CPCA:Enhanced Features of visible branch with infrared branch

  - [[5, 9], 1, FeatureAdd, []]       # 10-P3/8 stream one vis+Enhanced Features
  - [-1, 6, Light_HGBlock, [128, 512, 3]]                   # 11
  - [-1, 6, Light_HGBlock, [128, 512, 3, 3, True]]          # 12  stage2
  - [-1, 1, DWConv, [512, 3, 2, 1, False]]                  # 13  P4/16

  - [[8, 9], 1, FeatureAdd, []]       # 14-P3/8 stream one vis+Enhanced Features
  - [-1, 6, Light_HGBlock, [128, 512, 3]]                   # 15
  - [-1, 6, Light_HGBlock, [128, 512, 3, 3, True]]          # 16 stage2
  - [-1, 1, DWConv, [512, 3, 2, 1, False]]                  # 17 P4/16

    # 第二个CPCA模块
  - [[13, 17], 1, LAEF, [512, 256]]   # 18-P4/16 CPCA:Enhanced Features of visible branch with infrared branch

  - [[13, 18], 1, FeatureAdd, []]       # 19-P3/8 stream one vis+Enhanced Features
  - [-1, 6, Light_HGBlock, [256, 1024, 5, 3, False]]        # 20
  - [-1, 6, Light_HGBlock, [256, 1024, 5, 3, True]]         # 21
  - [-1, 6, Light_HGBlock, [256, 1024, 5, 3, True]]         # 22 
  - [-1, 6, Light_HGBlock, [256, 1024, 5, 1, True]]         # 23
  - [-1, 6, Light_HGBlock, [256, 1024, 5, 1, True]]         # 24 stage3
  - [-1, 1, DWConv, [1024, 3, 2, 1, False]]                 # 25 P5/32
  - [-1, 6, Light_HGBlock, [512, 2048, 5, 1, False]]  #26
  - [-1, 6, Light_HGBlock, [512, 2048, 5, 1, True]]  # 27-stage 4

  - [[17, 18], 1, FeatureAdd, []]       # 28-P3/8 stream one vis+Enhanced Features
  - [-1, 6, Light_HGBlock, [256, 1024, 5, 3, False]]        # 29
  - [-1, 6, Light_HGBlock, [256, 1024, 5, 3, True]]         # 30
  - [-1, 6, Light_HGBlock, [256, 1024, 5, 3, True]]         # 31 
  - [-1, 6, Light_HGBlock, [256, 1024, 5, 3, True]]         # 32
  - [-1, 6, Light_HGBlock, [256, 1024, 5, 3, True]]         # 33 stage3
  - [-1, 1, DWConv, [1024, 3, 2, 1, False]]                 # 34 P5/32
  - [-1, 6, Light_HGBlock, [512, 2048, 5, 3, False]]  #35
  - [-1, 6, Light_HGBlock, [512, 2048, 5, 3, True]]  # 36-stage 4

  - [[12, 16], 1, MDAFP, [512, 4, 'WithBias', [7,11], 0.0, False]]   # 37 Fuse P3/8 (recall-friendly)
  - [[24, 33], 1, MDAFP, [1024, 8, 'WithBias', [7,11,21], 0.0, False]]   # 38 Fuse P4/16 (dim=1024, heads=8)
  - [[27, 36], 1, MDAFP, [1024, 8, 'WithBias', [7,11,21], 0.0, False]]    # 39 Fuse P5/32 (dim=1024, heads=8)


  - [-1, 1, SPPF, [1024, 5]]         # 40 P5 context aggregation
  - [-1, 1, PSA, [1024]]           # 41 P5 feature enhancement

# Head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 42 upsample (P5->P4)
  - [[-1, 38], 1, Concat, [1]]                  # 43 concat with fused P4
  - [-1, 2, C3k2, [512, False]]                 # 44 P4

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 45 upsample (P4->P3)
  - [[-1, 37], 1, Concat, [1]]                  # 46 concat with fused P3
  - [-1, 3, C3k2, [256, False]]                 # 47 P3 (small)

  - [-1, 1, Conv, [256, 3, 2]]                  # 48 downsample (P3->P4)
  - [[-1, 44], 1, Concat, [1]]                  # 49 concat head P4
  - [-1, 2, C3k2, [512, False]]                 # 50 P4 (medium)

  - [-1, 1, Conv, [512, 3, 2]]                  # 51 downsample (P4->P5)
  - [[-1, 41], 1, Concat, [1]]                  # 52 concat with backbone P5 enhanced
  - [-1, 2, C3k2, [1024, True]]                 # 53 P5 (large)

  - [[47, 50, 53], 1, Detect, [nc]]             # 54 Detect(P3, P4, P5)
